.emacs.d/config/org-config.org
#+TITLE: org-mode configuration ꙮ

#+BEGIN_QUOTE
Org-mode is a powerful system for organizing your complex life with
simple plain-text files. It seamlessly integrates all your notes,
mindmaps, TODO lists, calendar, day planner, and project schedules
into a single system that can be easily searched (e.g. by grep),
encrypted (e.g. by GnuPG), backed up and synced (e.g. by Dropbox),
imported/exported, and accessed on the go (e.g. on an iPhone or
Android smartphone). It can even be used for authoring web pages and
documents.
#+END_QUOTE

Depending on how this section grows, org-mode might need its own
litterate org configuration file.

Let's define a bunch of variable name that will be useful later (like
where are =org-mode= file stored, etc.)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-root-directory (expand-file-name "org" desktop-directory)
        org-sites-directory-name "sites"
        org-archive-directory-name "archive"
        org-archive-file-pattern "/%s_archive::"
        org-inbox-file "inbox.org"
        org-main-file "personal.org"
        org-todos-directory org-root-directory
        org-notes-directory org-root-directory
        org-sites-directory (expand-file-name org-sites-directory-name org-root-directory)
        org-archive-directory (expand-file-name org-archive-directory-name org-root-directory)
        org-docker-file "docker.org"
        org-journal-file "journal.org"
        org-publish-folder (substitute-env-in-file-name "$HOME/var/public_html")
        sites-folder (substitute-env-in-file-name "$HOME/src/sites/"))
#+END_SRC

* Standard configuration

First let's define the default directory for the =org= files, the one
to be added to the agenda and the archives.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org
    :ensure t)
  (require 'find-lisp)
  (setq org-directory org-root-directory)
  (setq org-agenda-files (find-lisp-find-files org-todos-directory "\.org$"))
  (setq org-enforce-todo-dependencies t)
  (setq org-enforce-todo-checkbox-dependencies t)

  (setq org-log-redeadline (quote time))
  (setq org-log-reschedule (quote time))

  ;;warn me of any deadlines in next 7 days
  (setq org-deadline-warning-days 7)
  ;;show me tasks scheduled or due in next fortnight
  (setq org-agenda-span (quote fortnight))
  ;;don't show tasks as scheduled if they are already shown as a deadline
  (setq org-agenda-skip-scheduled-if-deadline-is-shown t)
  ;;don't give awarning colour to tasks with impending deadlines
  ;;if they are scheduled to be done
  (setq org-agenda-skip-deadline-prewarning-if-scheduled (quote pre-scheduled))
  ;;don't show tasks that are scheduled or have deadlines in the
  ;;normal todo list
  (setq org-agenda-todo-ignore-deadlines (quote all))
  (setq org-agenda-todo-ignore-scheduled (quote all))
  ;;sort tasks in order of when they are due and then by priority
  (setq org-agenda-sorting-strategy
    (quote
     ((agenda deadline-up priority-down)
      (todo priority-down category-keep)
      (tags priority-down category-keep)
      (search category-keep))))
#+END_SRC

Let's also define the default /todo-keywords/ and the workflow between
them.

- =TODO= : task not started yet, part of the backlog :)
- =PROGRESS= : task that are currently in progress, should be a minimum
- =BLOCKED= : task that I start working on but cannot anymore (for
  some reason), thus they are blocked
- =REVIEW= : task that should be done, but I need or wait for a review
  (by someone else or by me)
- =DONE= : task that are completed.
- =ARCHIVED= : same as done but keep it here (and not moving into
  archive)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "PROGRESS(p)" "PAUSED" "BLOCKED" "REVIEW" "|" "DONE(d!)" "ARCHIVED")
                (sequence "REPORT(r!)" "BUG" "KNOWNCAUSE" "|" "FIXED(f!)")
                (sequence "|" "CANCELLED(c@)"))))
  (setq org-todo-keyword-faces
        (quote (("TODO" . org-todo)
                ("PROGRESS" . "green")
                ("PAUSED" . "cyan")
                ("BLOCKED" . "red")
                ("REVIEW" . "yellow")
                ("DONE" . org-done)
                ("ARCHIVED" . org-done)
                ("CANCELLED" . "black")
                ("REPORT" . org-todo)
                ("BUG" . "red")
                ("KNOWNCAUSE" . "yellow")
                ("FIXED" . org-done))))

  (setq org-todo-state-tags-triggers
        (quote (("CANCELLED" ("CANCELLED" . t)))))
#+END_SRC

If a parent has all it's children =DONE=, make it =DONE= too.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun org-summary-todo (n-done n-not-done)
    "Switch entry to DONE when all subentries are done, to PROGRESS otherwise."
    (let (org-log-done org-log-states)   ; turn off logging
      (if (not (string-blank-p (org-get-todo-state)))
          (org-todo (if (= n-not-done 0) "DONE" "PROGRESS")))
      ))

  (add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
#+END_SRC

* Archives

We want to be able to archive some /done/ projects. Let's load
org-archive and configure it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'org-archive)
  (setq org-archive-location (concat org-archive-directory org-archive-file-pattern))
#+END_SRC

Let's also have some /auto-archive/ stuff, taken inspiration from [[http://article.gmane.org/gmane.emacs.orgmode/2963][john wiegley]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar org-my-archive-expiry-days 9
    "The number of days after which a completed task should be auto-archived.
  This can be 0 for immediate, or a floating point value.")

  (defun org-archive-done-tasks ()
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "\* \\(DONE\\|CANCELED\\) " nil t)
     (if (save-restriction
              (save-excursion
          (org-narrow-to-subtree)
          (search-forward ":LOGBOOK:" nil t)))
            (forward-line)
          (org-archive-subtree)
          (goto-char (line-beginning-position))))))

  (defalias 'archive-done-tasks 'org-archive-done-tasks)
#+END_SRC

* Captures

Let's define some useful function… Mainly add support for allowing
prompt input in templates (see [[http://storax.github.io/blog/2016/05/02/org-capture-tricks/][org-capture-tricks]]).

#+BEGIN_SRC emacs-lisp :tangle yes
  (defvar oc-capture-prmt-history nil
    "History of prompt answers for org capture.")
  (defun oc/prmt (prompt variable)
    "PROMPT for string, save it to VARIABLE and insert it."
    (make-local-variable variable)
    (set variable (read-string (concat prompt ": ") nil oc-capture-prmt-history)))
  (defun oc/inc (what text &rest fmtvars)
    "Ask user to include WHAT.  If user agrees return TEXT."
    (when (y-or-n-p (concat "Include " what "?"))
      (apply 'format text fmtvars)))
#+END_SRC

Setup captures templates..

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-capture-templates
     '(;; other entries
          ("t" "inbox"
        entry (file (expand-file-name org-inbox-file org-todos-directory))
           "* %?\n%i\n%a")
          ("d" "task"
        entry (file+headline (expand-file-name org-main-file org-todos-directory) "Tasks")
           "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n")
          ("d" "docker task"
        entry (file+headline (expand-file-name org-docker-file org-todos-directory) "Tasks")
           "* TODO gh:docker/%(oc/prmt \"project\" 'd-prj)#%(oc/prmt \"issue/pr\" 'd-issue) %?%(oc/inc \"feature content\" \" [/]\n- [ ] Implementation\n- [ ] Tests\n- [ ] Docs\")")
          ("j" "Journal entry"
           entry (file+datetree+prompt (expand-file-name org-journal-file org-root-directory))
           "* %?\n%i\nFrom: %a\n%U" :empty-lines 1)
          ;; other entries
          ))
#+END_SRC

