.emacs.d/config/org-config.el

(setq org-root-directory (expand-file-name "org" desktop-directory)
      org-sites-directory-name "sites"
      org-archive-directory-name "archive"
      org-archive-file-pattern "/%s_archive::"
      org-inbox-file "inbox.org"
      org-main-file "personal.org"
      org-todos-directory org-root-directory
      org-notes-directory org-root-directory
      org-sites-directory (expand-file-name org-sites-directory-name org-root-directory)
      org-archive-directory (expand-file-name org-archive-directory-name org-root-directory)
      org-docker-file "docker.org"
      org-journal-file "journal.org"
      org-publish-folder (substitute-env-in-file-name "$HOME/var/public_html")
      sites-folder (substitute-env-in-file-name "$HOME/src/sites/"))

(use-package org
  :ensure t)
(require 'find-lisp)
(setq org-directory org-root-directory)
(setq org-agenda-files (find-lisp-find-files org-todos-directory "\.org$"))
(setq org-enforce-todo-dependencies t)
(setq org-enforce-todo-checkbox-dependencies t)

(setq org-log-redeadline (quote time))
(setq org-log-reschedule (quote time))

;;warn me of any deadlines in next 7 days
(setq org-deadline-warning-days 7)
;;show me tasks scheduled or due in next fortnight
(setq org-agenda-span (quote fortnight))
;;don't show tasks as scheduled if they are already shown as a deadline
(setq org-agenda-skip-scheduled-if-deadline-is-shown t)
;;don't give awarning colour to tasks with impending deadlines
;;if they are scheduled to be done
(setq org-agenda-skip-deadline-prewarning-if-scheduled (quote pre-scheduled))
;;don't show tasks that are scheduled or have deadlines in the
;;normal todo list
(setq org-agenda-todo-ignore-deadlines (quote all))
(setq org-agenda-todo-ignore-scheduled (quote all))
;;sort tasks in order of when they are due and then by priority
(setq org-agenda-sorting-strategy
  (quote
   ((agenda deadline-up priority-down)
    (todo priority-down category-keep)
    (tags priority-down category-keep)
    (search category-keep))))

(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "PROGRESS(p)" "PAUSED" "BLOCKED" "REVIEW" "|" "DONE(d!)" "ARCHIVED")
              (sequence "REPORT(r!)" "BUG" "KNOWNCAUSE" "|" "FIXED(f!)")
              (sequence "|" "CANCELLED(c@)"))))
(setq org-todo-keyword-faces
      (quote (("TODO" . org-todo)
              ("PROGRESS" . "green")
              ("PAUSED" . "cyan")
              ("BLOCKED" . "red")
              ("REVIEW" . "yellow")
              ("DONE" . org-done)
              ("ARCHIVED" . org-done)
              ("CANCELLED" . "black")
              ("REPORT" . org-todo)
              ("BUG" . "red")
              ("KNOWNCAUSE" . "yellow")
              ("FIXED" . org-done))))

(setq org-todo-state-tags-triggers
      (quote (("CANCELLED" ("CANCELLED" . t)))))

(defun org-summary-todo (n-done n-not-done)
  "Switch entry to DONE when all subentries are done, to PROGRESS otherwise."
  (let (org-log-done org-log-states)   ; turn off logging
    (if (not (string-blank-p (org-get-todo-state)))
        (org-todo (if (= n-not-done 0) "DONE" "PROGRESS")))
    ))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)

(require 'org-archive)
(setq org-archive-location (concat org-archive-directory org-archive-file-pattern))

(defvar org-my-archive-expiry-days 9
  "The number of days after which a completed task should be auto-archived.
This can be 0 for immediate, or a floating point value.")

(defun org-archive-done-tasks ()
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\* \\(DONE\\|CANCELED\\) " nil t)
   (if (save-restriction
            (save-excursion
        (org-narrow-to-subtree)
        (search-forward ":LOGBOOK:" nil t)))
          (forward-line)
        (org-archive-subtree)
        (goto-char (line-beginning-position))))))

(defalias 'archive-done-tasks 'org-archive-done-tasks)

(defvar oc-capture-prmt-history nil
  "History of prompt answers for org capture.")
(defun oc/prmt (prompt variable)
  "PROMPT for string, save it to VARIABLE and insert it."
  (make-local-variable variable)
  (set variable (read-string (concat prompt ": ") nil oc-capture-prmt-history)))
(defun oc/inc (what text &rest fmtvars)
  "Ask user to include WHAT.  If user agrees return TEXT."
  (when (y-or-n-p (concat "Include " what "?"))
    (apply 'format text fmtvars)))

(setq org-capture-templates
   '(;; other entries
        ("t" "inbox"
      entry (file (expand-file-name org-inbox-file org-todos-directory))
         "* %?\n%i\n%a")
        ("d" "task"
      entry (file+headline (expand-file-name org-main-file org-todos-directory) "Tasks")
         "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n")
        ("d" "docker task"
      entry (file+headline (expand-file-name org-docker-file org-todos-directory) "Tasks")
         "* TODO gh:docker/%(oc/prmt \"project\" 'd-prj)#%(oc/prmt \"issue/pr\" 'd-issue) %?%(oc/inc \"feature content\" \" [/]\n- [ ] Implementation\n- [ ] Tests\n- [ ] Docs\")")
        ("j" "Journal entry"
         entry (file+datetree+prompt (expand-file-name org-journal-file org-root-directory))
         "* %?\n%i\nFrom: %a\n%U" :empty-lines 1)
        ;; other entries
        ))
