.emacs.d/config/org-config.el

(org-add-link-type
 "grep" 'my/follow-grep-link
 )
(defun my/follow-grep-link (regexp)
  "Run `rgrep' with REGEXP and FOLDER as argument,
like this : [[grep:REGEXP:FOLDER]]."
  (setq expressions (split-string regexp ":"))
  (setq exp (nth 0 expressions))
  (grep-compute-defaults)
  (if (= (length expressions) 1)
      (progn
        (rgrep exp "*" (expand-file-name "./")))
    (progn
      (setq folder (nth 1 expressions))
      (rgrep exp "*" (expand-file-name folder))))
  )

(use-package pt
  :load-path "~/.emacs.d/lisp/pt/")

;; pt-regexp (regexp directory &optional args)
(org-add-link-type
 "pt" 'my/follow-pt-link)
(defun my/follow-pt-link (regexp)
  "Run `pt-regexp` with REXEP and FOLDER as argument,
like this : [[pt:REGEXP:FOLDER]]"
  (setq expressions (split-string regexp ":"))
  (setq exp (nth 0 expressions))
  (if (= (length expressions) 1)
      (progn
        (pt-regexp exp (expand-file-name "./")))
    (progn
      (setq folder (nth 1 expressions))
      (pt-regexp exp (file-name-as-directory (expand-file-name folder)))))
  )

(defvar yt-iframe-format
  ;; You may want to change your width and height.
  (concat "<iframe width=\"440\""
          " height=\"335\""
          " src=\"https://www.youtube.com/embed/%s\""
          " frameborder=\"0\""
          " allowfullscreen>%s</iframe>"))

(org-add-link-type
 "youtube"
 (lambda (handle)
   (browse-url
    (concat "https://www.youtube.com/embed/"
            handle)))
 (lambda (path desc backend)
   (cl-case backend
     (html (format yt-iframe-format
                   path (or desc "")))
     (latex (format "\href{%s}{%s}"
                    path (or desc "video"))))))

(org-add-link-type
 "gh" 'my/follow-gh-link)
(defun my/follow-gh-link (issue)
  "Browse github issue/pr specified"
  (setq expressions (split-string issue "#"))
  (setq project (nth 0 expressions))
  (setq issue (nth 1 expressions))
  (browse-url
   (format "https://github.com/%s/issues/%s" project issue)))

(setq org-link-abbrev-alist
      '(("gmane" . "http://thread.gmane.org/%s")
        ("google" . "https://www.google.com/search?q=%s")
        ("github" . "http://github.com/%s")
        ))

;; from http://endlessparentheses.com/use-org-mode-links-for-absolutely-anything.html
(org-add-link-type
 "tag" 'endless/follow-tag-link)

(defun endless/follow-tag-link (tag)
  "Display a list of TODO headlines with tag TAG.
With prefix argument, also display headlines without a TODO keyword."
  (org-tags-view (null current-prefix-arg) tag))

(setq org-src-fontify-natively t)
(setq org-html-htmlize-output-type 'css)
(setq org-html-htmlize-font-prefix "org-")
(org-babel-do-load-languages
 'org-babel-load-languages
 '( (perl . t)
    (ruby . t)
    (sh . t)
    (python . t)
    (emacs-lisp . t)
    ;; (golang . t)
    (haskell . t)
    (ditaa . t)
    ))

(defun my/org-insert-src-block (src-code-type)
  "Insert a `SRC-CODE-TYPE' type source code block in org-mode."
  (interactive
   (let ((src-code-types
          '("emacs-lisp" "python" "C" "sh" "java" "js" "clojure" "C++" "css"
            "calc" "dot" "gnuplot" "ledger" "R" "sass" "screen" "sql" "awk"
            "ditaa" "haskell" "latex" "lisp" "matlab" "org" "perl" "ruby"
            "sqlite" "rust" "scala" "golang" "restclient")))
     (list (ido-completing-read "Source code type: " src-code-types))))
  (progn
    (newline-and-indent)
    (insert (format "#+BEGIN_SRC %s\n" src-code-type))
    (newline-and-indent)
    (insert "#+END_SRC\n")
    (previous-line 2)
    (org-edit-src-code)))

(defun my/org-insert-html-block ()
  "Insert a `HTML-BLOCK` type in org-mode."
  (interactive
   (progn
     (newline-and-indent)
     (insert "#+BEGIN_HTML\n")
     (newline-and-indent)
     (insert "#+END_HTML\n")
     (previous-line 2))))


(defun my/org-insert-blockquote-block ()
  "Insert a `BLOCKQUOTE-BLOCK` type in org-mode."
  (interactive
   (progn
     (newline-and-indent)
     (insert "#+BEGIN_BLOCKQUOTE\n")
     (newline-and-indent)
     (insert "#+END_BLOCKQUOTE\n")
     (previous-line 2))))



(add-hook 'org-mode-hook
          '(lambda ()
             (local-set-key (kbd "C-c s e") 'org-edit-src-code)
             (local-set-key (kbd "C-c s i") 'my/org-insert-src-block)
             (local-set-key (kbd "C-c s h") 'my/org-insert-html-block)
             (local-set-key (kbd "C-c s b") 'my/org-insert-blockquote-block))
          'append)

(require 'org-archive)
(setq org-archive-location (concat org-archive-directory org-archive-file-pattern))

(defvar org-my-archive-expiry-days 9
  "The number of days after which a completed task should be auto-archived.
This can be 0 for immediate, or a floating point value.")

(defun org-archive-done-tasks ()
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (while (re-search-forward "\* \\(DONE\\|CANCELED\\) " nil t)
   (if (save-restriction
            (save-excursion
        (org-narrow-to-subtree)
        (search-forward ":LOGBOOK:" nil t)))
          (forward-line)
        (org-archive-subtree)
        (goto-char (line-beginning-position))))))

(defalias 'archive-done-tasks 'org-archive-done-tasks)
