.emacs.d/config/org-config.org
* Tags

Tags should be displayed from the 90 column.

#+BEGIN_SRC emacs-lisp
  (setq org-tags-column -90)
#+END_SRC

Define a list of default tags that should apply for all org-mode
buffers.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Wish I could use taggroup but it doesn't seem to work..
  (setq org-tag-alist '(
                     ("important" . ?i)
                     ("ongoing" . ?o)         ;; ongoing "project", use to filter big project that are on the go
                     ("next" . ?n)            ;; next "project"/"task", use to filter next things to do
                     ("@home" . ?h)           ;; needs to be done at home
                     ("@work" . ?w)           ;; needs to be done at work
                     ("dev" . ?e)             ;; this is a development task
                     ("infra" . ?a)           ;; this is a sysadmin/infra task
                     ("document" . ?d)        ;; needs to produce a document (article, post, ..)
                     ("download" . ?D)        ;; needs to download something
                     ("media" . ?m)           ;; this is a media (something to watch, listen, record, ..)
                     ("mail" . ?M)            ;; mail-related (to write & send or to read)
                     ("triage" . ?t)          ;; need "triage", tag it to easily find them
                     ("task" . ?a)            ;; a simple task (no project), the name is kinda misleading
                     ;; docker-related tags
                     ("docker")
                     ("kubernetes")
                     ("compose")
                     ("moby")
                     ("linuxkit")
                     ("docs")
                     ;; languages
                     ("golang")
                     ("python")
                     ("java")
                     ("clojure")
                     ("emacs-lisp")
                     ;; sites tags
                     ("sites")
                     ("vdf")
                     ;; configs tags
                     ("configs")
                     ("emacs")
                     ("i3")
                     ("shell")
                     ;; services
                     ("services")
                     ))
#+END_SRC

Note that =important= and =urgent= helps me prioritize my /todos/, in
a /quadrant fashion way/.

| Important          | *Kaizen*        | *Panic*             |
| /tag important/    | improvements    | emergency           |
|--------------------+-----------------+---------------------|
| Less Important     | *Organics*      | Social *investment* |
| /no tag important/ | inspiration     | Social activities   |
|--------------------+-----------------+---------------------|
|                    | Less Urgent     | Urgent              |
|                    | /no tag urgent/ | /tag urgent/        |

* Clocks

Let's configure org-mode clocks a little bit. Let's first setup some
common things.

#+BEGIN_SRC emacs-lisp :tange yes
  ;; Sometimes I change tasks I'm clocking quickly
  ;; this removes clocked tasks with 0:00 duration
  (setq org-clock-out-remove-zero-time-clocks 1)
  ;; Clock out when moving task to a done state
  (setq org-clock-out-when-done 1)
  ;; If idle for more than 15 minutes, resolve the things by asking what to do
  ;; with the clock time
  (setq org-clock-idle-time 15)
#+END_SRC

We also want to set the state to =PROGRESS= when we are clocking in.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defadvice org-clock-in (after sacha activate)
    "Set this task's status to 'PROGRESS'."
    (org-todo "PROGRESS"))
#+END_SRC

* Agenda(s)

Set custom agendas.. For the syntax, look in worg : [[http://orgmode.org/worg/org-tutorials/advanced-searching.html][Advanced searching]]
and [[http://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.html][Custom Agenda Commands]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-agenda-custom-commands
        '(("d" "Daily agenda and all TODOs"
           ((tags "urgent+PRIORITY=\"A\""
                  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "High-priority unfinished tasks:")))
            (agenda "" ((org-agenda-ndays 1)))
            (tags "next"
                  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "Today's tasks")))
            (tags "PRIORITY=\"A\""
                  ((org-agenda-skip-function '(or (org-agenda-skip-entry-if 'tag 'urgent)
                                                  (org-agenda-skip-entry-if 'todo 'done)))
                   (org-agenda-overriding-header "Kaizen tasks -improvement-")))
            (alltodo ""
                     ((org-agenda-sorting-strategy '(priority-down))
                      (org-agenda-skip-function '(or (org-agenda-skip-entry-if 'todo 'progress)
                                                     (org-agenda-skip-entry-if 'todo 'review)
                                                     (org-agenda-skip-entry-if 'todo 'done)
                                                     (vde/org-skip-subtree-if-habit)
                                                     (vde/org-skip-subtree-if-priority ?A)
                                                     (org-agenda-skip-if nil '(scheduled deadline))))
                      (org-agenda-overriding-header "ALL normal priority tasks:"))))
           ((org-agenda-compact-blocks t)))
          ("t" todo "TODO"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("p" todo "PROGRESS"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("r" todo "REVIEW"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("u" todo "PAUSED"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("b" todo "BLOCKED"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("n" "Next tasks" tags-todo "next"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-tags-exclude-from-inheritance '("next"))
            (org-agenda-prefix-format "  Mixed: ")))
          ("i" "Triage tasks — to look" tags-todo "triage"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ;; Timelines
          ("d" "Timeline for today" ((agenda "" ))
           ((org-agenda-ndays 1)
            (org-agenda-show-log t)
            (org-agenda-log-mode-items '(clock closed))
            (org-agenda-clockreport-mode t)
            (org-agenda-entry-types '())))
          ("w" "Weekly review" agenda ""
           ((org-agenda-span 7)
            (org-agenda-log-mode 1)))
          ("W" "Weekly review sans DAILY" agenda ""
           ((org-agenda-span 7)
            (org-agenda-log-mode 1)
            (org-agenda-tag-filter-preset '("-DAILY"))))
          ;; Panic tasks : urgent & important
          ;; Probably the most important to do, but try not have to much of them..
          ("P" "Panic -emergency-" tags-todo "urgent+PRIORITY=\"A\""
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ;; Kaizen tasks : important but not urgent
          ("K" "Kaizen -improvement-" tags-todo "PRIORITY=\"A\"&-urgent"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ;; Social investment : urgent
          ("S" "Social -investment-" tags-todo "-PRIORITY=\"A\"+urgent"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ;; Organics
          ("O" "Organics -inspiration-" tags-todo "-PRIORITY=\"A\"&-urgent"
           ((org-agenda-sorting-strategy '(priority-down))
            (org-agenda-prefix-format "  Mixed: ")))
          ("N" search ""
           ((org-agenda-text-search-extra-files nil)))))

  (defun vde/org-skip-subtree-if-priority (priority)
    "Skip an agenda subtree if it has a priority of PRIORITY.

  PRIORITY may be one of the characters ?A, ?B, or ?C."
    (let ((subtree-end (save-excursion (org-end-of-subtree t)))
          (pri-value (* 1000 (- org-lowest-priority priority)))
          (pri-current (org-get-priority (thing-at-point 'line t))))
      (if (= pri-value pri-current)
          subtree-end
        nil)))

  (defun vde/org-skip-subtree-if-habit ()
    "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
    (let ((subtree-end (save-excursion (org-end-of-subtree t))))
      (if (string= (org-entry-get nil "STYLE") "habit")
          subtree-end
        nil)))
#+END_SRC

