.emacs.d/config/org-config.org
* Publishing

Let's configure the publishing part of org-mode. The first org-mode
files we want to publish are in =~/desktop/org/sites/{project}=, and
we want to publish them in =~/var/public_html/{project}= for now.

Few org-export and org-html configuration.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package htmlize
    :ensure t
    :defer t)
  ;;      (setq org-html-head "<link rel=\"stylesheet\" type=\"text/css\" hrefl=\"css/stylesheet.css\" />")
  (setq org-html-include-timestamps nil)
  ;; (setq org-html-htmlize-output-type 'css)
  (setq org-html-head-include-default-style nil)
#+END_SRC

And the projects.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package ox-publish)
  ;; (use-package ox-rss)

  (setq org-html-html5-fancy t)

  ;; Define some variables to write less :D
  (setq sbr-base-directory (expand-file-name "sbr" org-sites-directory)
        sbr-publishing-directory (expand-file-name "sbr" org-publish-folder)
        vdf-base-directory (expand-file-name "vdf" org-sites-directory)
        vdf-site-directory (expand-file-name "blog" github-personal-folder)
        vdf-publishing-directory (expand-file-name "posts" (expand-file-name "content" vdf-site-directory))
        vdf-static-directory (expand-file-name "static" vdf-site-directory)
        vdf-css-publishing-directory (expand-file-name "css" vdf-static-directory)
        vdf-assets-publishing-directory vdf-static-directory)

  ;; Project
  (setq org-publish-project-alist
        `(("sbr-notes"
           :base-directory ,sbr-base-directory
           :base-extension "org"
           :publishing-directory ,sbr-publishing-directory
           :makeindex t
           :exclude "FIXME"
           :recursive t
           :htmlized-source t
           :publishing-function org-html-publish-to-html
           :headline-levels 4
           :auto-preamble t
           :html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"style/style.css\" />"
           :html-preamble "<div id=\"nav\">
  <ul>
  <li><a href=\"/\" class=\"home\">Home</a></li>
  </ul>
  </div>"
           :html-postamble "<div id=\"footer\">
  %a %C %c
  </div>")
          ("sbr-static"
           :base-directory ,sbr-base-directory
           :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg"
           :publishing-directory ,sbr-publishing-directory
           :recursive t
           :publishing-function org-publish-attachment
           )
          ("sbr" :components ("sbr-notes" "sbr-static"))
          ("vdf-notes"
           :base-directory ,vdf-base-directory
           :base-extension "org"
           :publishing-directory ,vdf-publishing-directory
           :exclude "FIXME"
           :section-numbers nil
           :with-toc nil
           :with-drawers t
           :htmlized-source t
           :org-html-htmlize-output-type 'css
           :html-html5-fancy t
           :publishing-function org-html-publish-to-html
           :headline-levels 4
           :body-only t)
          ("vdf-static-css"
           :base-directory ,vdf-base-directory
           :base-extension "css"
           :publishing-directory ,vdf-css-publishing-directory
           :recursive t
           :publishing-function org-publish-attachment
           )
          ("vdf-static-assets"
           :base-directory ,vdf-base-directory
           :base-extension "png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg"
           :publishing-directory ,vdf-assets-publishing-directory
           :recursive t
           :publishing-function org-publish-attachment
           )
          ("vdf" :components ("vdf-notes" "vdf-static-css" "vdf-static-assets"))
          ))
#+END_SRC
* Provide configuration
#+BEGIN_SRC emacs-lisp :tangle yes
  (provide 'org-config)
#+END_SRC
